In [28]:
import pandas as pd

[Перевод строковых значений в числа](#str_to_num)

[Методы Pandas для работы с датой и временем](#D_T)

[Обработка ошибок try-except](#try_except)

[Сводные таблицы](#pivot_table)

[Лаборатория ручного поиска дубликатов](#dupl)

«Определить, какие товарные категории и подкатегории на сайте представлены в поисковиках хуже всего»

In [29]:
data = pd.read_excel('seo_data.xlsx',sheet_name='traffic_data')

In [30]:
display(data.info())
data.tail(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB

None

     subcategory_id   source     visits  Unnamed: 3
1920     657ad4152e  organic  24.748969         NaN
1921     ee2093ef96  organic  24.468693         NaN
1922     94f5224c98  organic  24.433584         NaN
1923     3f7f42af50  organic  21.544606         NaN
1924     779e246861  organic  15.813045         NaN
1925     c51343bf77  organic  15.640773         NaN
1926     d942687638  organic   13.87554         NaN
1927     976642886f  organic   9.204211         NaN
1928     075994491e  organic   4.606261         NaN
1929          total  organic  "5687882"         NaN

In [31]:
data['source'].unique()

array(['direct', 'organic'], dtype=object)

In [32]:
subcategory_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'subcategory_ids')

In [33]:
subcategory_dict.head(10)

  subcategory_id                subcategory_name category_id
0     cf2e61c7af              Мобильные телефоны  09f279a643
1     0cd903d1cc                        Ноутбуки  3509869a61
2     ef35bc88a7                      Телевизоры  09f279a643
3     6ff9f4014c                        Планшеты  3509869a61
4     72bc238e4d  Наушники и Bluetooth-гарнитуры  09f279a643
5     88c78ea685                            Шины  65922fa39c
6     179bfacf4a           Умные часы и браслеты  09f279a643
7     b0fb8f259a                        Мониторы  3509869a61
8     3c67eb2d90                   Наручные часы  6074ad29ac
9     24e6c815c6  Лекарственные препараты и БАДы  10a493e03b

In [34]:
category_dict = pd.read_excel('seo_data.xlsx',sheet_name= 'category_ids')

In [35]:
category_dict.head(10)

  category_id               category_name
0  09f279a643                 Электроника
1  3509869a61        Компьютерная техника
2  65922fa39c                        Авто
3  6074ad29ac  Одежда, обувь и аксессуары
4  10a493e03b         Товары для здоровья
5  5a0d8ac946             Бытовая техника
6  7dbac4c1a3              Детские товары
7  ae99947659               Спорт и отдых
8  655ccc3c49          Товары для красоты
9  394f20d8fa      Строительство и ремонт

In [36]:
print(data.groupby('source')['source'].count())

source
direct     965
organic    965
Name: source, dtype: int64

In [37]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1930 entries, 0 to 1929
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1930 non-null   object
 1   source          1930 non-null   object
 2   visits          1930 non-null   object
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), object(3)
memory usage: 60.4+ KB
None

Объединим несколько таблиц в одну методом merge(). Передавая тот или иной аргумент методу merge(), можно по-разному объединять таблицы. Подробнее об этом будет рассказано в следующем спринте.
merge() применяют к таблице, к которой присоединяют другую. У метода следующие аргументы:
right — имя DataFrame или Series, присоединяемого к исходной таблице.
on — название общего списка в двух соединяемых таблицах: по нему происходит слияние.
how — чьи id включать в итоговую таблицу. Аргумент how может принять значение left: тогда в итоговую таблицу будут включены id из левой таблицы. Аргумент right включает id из правой таблицы.

In [38]:
#Объедините самостоятельно таблицы из переменных subcategory_dict и data. Результат сохраните в переменной data_subcategory
data_subcategory = data.merge(subcategory_dict,on='subcategory_id',how='left')

In [39]:
data_subcategory

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id
0,cf2e61c7af,direct,501165.668858,NaN,Мобильные телефоны,09f279a643
1,0cd903d1cc,direct,126342.359505,NaN,Ноутбуки,3509869a61
2,ef35bc88a7,direct,95626.321402,NaN,Телевизоры,09f279a643
3,6ff9f4014c,direct,75680.653002,NaN,Планшеты,3509869a61
4,72bc238e4d,direct,64435.934651,NaN,Наушники и Bluetooth-гарнитуры,09f279a643
...,...,...,...,...,...,...
1925,c51343bf77,organic,15.640773,NaN,Свитеры и кардиганы,6074ad29ac
1926,d942687638,organic,13.87554,NaN,Термобелье,6074ad29ac
1927,976642886f,organic,9.204211,NaN,"Наклейки, шильдики и значки",65922fa39c
1928,075994491e,organic,4.606261,NaN,Гигиена полости рта,7dbac4c1a3
1929,total,organic,"""5687882""",NaN,NaN,NaN

In [40]:
#Объедините таблицы из переменных data_subcategory и category_dict.
#Результат сохраните в переменной data_final
data_final = data_subcategory.merge(category_dict,on='category_id',how='left')

In [41]:
data_final

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id,category_name
0,cf2e61c7af,direct,501165.668858,NaN,Мобильные телефоны,09f279a643,Электроника
1,0cd903d1cc,direct,126342.359505,NaN,Ноутбуки,3509869a61,Компьютерная техника
2,ef35bc88a7,direct,95626.321402,NaN,Телевизоры,09f279a643,Электроника
3,6ff9f4014c,direct,75680.653002,NaN,Планшеты,3509869a61,Компьютерная техника
4,72bc238e4d,direct,64435.934651,NaN,Наушники и Bluetooth-гарнитуры,09f279a643,Электроника
...,...,...,...,...,...,...,...
1925,c51343bf77,organic,15.640773,NaN,Свитеры и кардиганы,6074ad29ac,"Одежда, обувь и аксессуары"
1926,d942687638,organic,13.87554,NaN,Термобелье,6074ad29ac,"Одежда, обувь и аксессуары"
1927,976642886f,organic,9.204211,NaN,"Наклейки, шильдики и значки",65922fa39c,Авто
1928,075994491e,organic,4.606261,NaN,Гигиена полости рта,7dbac4c1a3,Детские товары
1929,total,organic,"""5687882""",NaN,NaN,NaN,NaN

## Перевод строковых значений в числа
<a id='str_to_num'></a>

In [42]:
transactions = pd.read_excel('ids.xlsx')

In [43]:
display(transactions['category'].unique())
transactions.head()

array(['C', 'B', 'D', 'A', 'E', 'Null'], dtype=object)

             id category    amount
0  600748331392        C  17515.36
1  600748331404        B  10117.56
2  600748331412        B  18489.26
3  600748331430        B   6620.22
4  600748331447        C    7559.9

In [44]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        49 non-null     object
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

transactions['amount'] = pd.to_numeric(transactions['amount']) 


У метода to_numeric() есть параметр errors. От значений, принимаемых errors, зависят действия to_numeric при встрече с некорректным значением:
`errors='raise' — дефолтное поведение: при встрече с некорректным значением выдаётся ошибка, операция перевода в числа прерывается;


`errors='coerce' — некорректные значения принудительно заменяются на NaN;


`errors='ignore' — некорректные значения игнорируются, но остаются.


transactions['amount'] = pd.to_numeric(transactions['amount'], errors='coerce') 
Методом to_numeric() мы не только превратим строки в числовой тип там, где это возможно, но и выясним, на каких значениях метод не работает.
Особенность метода to_numeric() в том, что при переводе все числа будут иметь тип данных float. Это подходит далеко не всем значениям. Но есть и хорошие новости: в нужный тип значения переводят методом astype(). Например, аргумент ('int') метода astype() означает, что значение нужно перевести в целое число:

In [45]:
transactions['id'] = pd.to_numeric(transactions['id'],errors='coerce')

In [46]:
transactions['id'].tail(5)

44    6.007483e+11
45    6.007483e+11
46    6.007483e+11
47    6.007483e+11
48             NaN
Name: id, dtype: float64

In [47]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    49 non-null     object
dtypes: float64(1), object(2)
memory usage: 1.3+ KB

In [48]:
transactions['amount'] = pd.to_numeric(transactions['amount'],errors='coerce')

In [49]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49 entries, 0 to 48
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        48 non-null     float64
 1   category  49 non-null     object
 2   amount    45 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.3+ KB

In [50]:
transactions['amount'].sum()

596107.1


Рассчитайте сумму продаж для каждой категории и сохраните в переменной transactions_per_category. Для этого сгруппируйте датафрейм transactions по столбцу category и примените метод sum() к столбцу amount. Выведите результат на экран.

In [51]:
 transactions_per_category = transactions.groupby('category')['amount'].sum()

In [52]:
print(transactions_per_category)

category
A       133988.50
B       168617.89
C       173332.50
D        62630.82
E        57537.39
Null         0.00
Name: amount, dtype: float64

In [53]:
data

     subcategory_id   source         visits  Unnamed: 3
0        cf2e61c7af   direct  501165.668858         NaN
1        0cd903d1cc   direct  126342.359505         NaN
2        ef35bc88a7   direct   95626.321402         NaN
3        6ff9f4014c   direct   75680.653002         NaN
4        72bc238e4d   direct   64435.934651         NaN
...             ...      ...            ...         ...
1925     c51343bf77  organic      15.640773         NaN
1926     d942687638  organic       13.87554         NaN
1927     976642886f  organic       9.204211         NaN
1928     075994491e  organic       4.606261         NaN
1929          total  organic      "5687882"         NaN

[1930 rows x 4 columns]

In [54]:
pd.to_numeric(data['visits'])

ValueError: Unable to parse string ""2369468"" at position 964

In [55]:
data.loc[964]

subcategory_id        total
source               direct
visits            "2369468"
Unnamed: 3              NaN
Name: 964, dtype: object

In [56]:
data[data['subcategory_id']=='total']

     subcategory_id   source     visits  Unnamed: 3
964           total   direct  "2369468"         NaN
1929          total  organic  "5687882"         NaN

In [57]:
data = data[data['subcategory_id']!='total']

In [58]:
data[data['subcategory_id']=='total']

Empty DataFrame
Columns: [subcategory_id, source, visits, Unnamed: 3]
Index: []

In [59]:
data['visits'] = data['visits'].astype('int')

<ipython-input-59-c5deef310c65>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['visits'] = data['visits'].astype('int')

In [60]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1928 entries, 0 to 1928
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   subcategory_id  1928 non-null   object
 1   source          1928 non-null   object
 2   visits          1928 non-null   int32
 3   Unnamed: 3      0 non-null      float64
dtypes: float64(1), int32(1), object(2)
memory usage: 67.8+ KB

In [61]:
data.groupby('source')['visits'].sum()

source
direct     2368980
organic    5687407
Name: visits, dtype: int32

## Методы Pandas для работы с датой и временем
<a id='D_T'></a>

Вне зависимости от способа записи, дату и время нужно вводить в арифметические операции. Для этого в Python существует особый тип данных — datetime.

Методом to_datetime() превратим содержимое этого столбца в понятные для Python даты.
Для этого строку форматируют, обращаясь к специальной системе обозначений, где:

%d — день месяца (от 01 до 31)

%m — номер месяца (от 01 до 12)

%Y — четырёхзначный номер года (например, 2019)

Z — стандартный разделитель даты и времени

%H — номер часа в 24-часовом формате

%I — номер часа в 12-часовом формате

%M — минуты (от 00 до 59)

%S — секунды (от 00 до 59)

Преобразуем формат даты 01.04.2019Z11:03:00 из первой строчки датафрейма:


Сначала номер дня месяца. В соответствии с таблицей форматов заменяем его на %d:
%d.04.2019Z11:03:00


Далее точка (ее оставляем без изменений), потом номер месяца: %m: %d.%m.2019Z11:03:00


После четырёхзначный номер года, заменяем 2019 на %Y: %d.%m.%YZ11:03:00


Букву Z оставляем без изменений: %d.%m.%YZ11:03:00
Номер часа в 24-часовом формате заменим на %H: %d.%m.%YZ%H:03:00
Количество минут обозначим %M: %d.%m.%YZ%H:%M:00
Завершим форматирование обозначением секунд %S: %d.%m.%YZ%H:%M:%S

## arrivals['date_datetime'] = pd.to_datetime(arrivals['date'], format='%d.%m.%YZ%H:%M:%S')
## print(arrivals.head())

А у значений столбца '*target_time*' другой способ записи даты: 2019-04-01Z11:00:00. Значит, и в аргументе format сохраним другое выражение: '%Y-%m-%dZ%H:%M:%S':


## arrivals['target_datetime'] = pd.to_datetime(
##    arrivals['target_time'], format='%Y-%m-%dZ%H:%M:%S')

In [62]:
position = pd.read_csv('position.csv')

In [63]:
position.head(15)

              timestamp  level   page_id
0   2019-02-04T13:22:34      1  6ukoNykP
1   2019-02-06T15:30:54      1  Q62R1Ue7
2   2019-02-08T14:53:45      1  GmfSxgPs
3   2019-02-10T16:50:22      2  M56OK96C
4   2019-02-12T14:16:28      1  q2fqVqPc
5   2019-02-14T15:10:45      1  LioXfSPk
6   2019-02-16T14:52:23      3  bQXWpQ2z
7   2019-02-18T15:45:33      2  gsFVGOTy
8   2019-02-20T16:35:12      3  zVuiSTm1
9   2019-02-22T15:52:27      1  kuULtbnm
10  2019-02-24T12:39:30      2  MKDhBt9L
11  2019-02-26T12:45:10      3  FEgRztcr
12  2019-03-04T15:34:46      4  OUBWQSCl
13  2019-03-06T14:20:57      5  6YeTUHgm
14  2019-03-08T12:34:43      6  zlrBrZ0d

In [64]:
position.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  39 non-null     object
 1   level      39 non-null     int64
 2   page_id    39 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.0+ KB

In [65]:
position['timestamp'] = pd.to_datetime(position['timestamp'],format='%Y-%m-%dT%H:%M:%S')

In [66]:
position.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   timestamp  39 non-null     datetime64[ns]
 1   level      39 non-null     int64
 2   page_id    39 non-null     object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 1.0+ KB

In [67]:
position.sort_values(by = 'level',ascending=False)

             timestamp  level   page_id
22 2019-03-24 13:49:22      9  WklxK6k4
38 2019-04-27 12:48:14      8  5VRryKr6
35 2019-04-21 14:40:17      8  JvTMAbs7
30 2019-04-11 13:39:15      8  9mL07Mjl
21 2019-03-22 16:36:19      8  s24ZIat3
15 2019-03-10 13:12:57      7  Vih5ARKA
34 2019-04-19 15:43:24      7  MSHZViNg
31 2019-04-13 12:13:26      7  ILfc3WmK
29 2019-04-09 14:57:20      7  SfnhoGh6
27 2019-04-05 14:51:38      7  7JKRCdPA
20 2019-03-20 15:53:36      7  VkTjZ6co
37 2019-04-25 16:10:50      6  clLGJ4g3
33 2019-04-17 16:54:17      6  JjIZd3Jy
28 2019-04-07 16:29:58      6  bsORIc79
24 2019-03-28 15:28:17      6  aQdvnaZX
19 2019-03-18 16:47:36      6  057NPKXX
14 2019-03-08 12:34:43      6  zlrBrZ0d
18 2019-03-16 16:18:34      5  zPH6tQwc
36 2019-04-23 13:17:19      5  6KVLFFQF
13 2019-03-06 14:20:57      5  6YeTUHgm
23 2019-03-26 15:50:31      5  p4Ofo5uP
25 2019-04-01 13:43:49      5  7UCXvXJu
32 2019-04-15 12:28:54      5  sCKAcOTN
12 2019-03-04 15:34:46      4  OUBWQSCl
17 2019-03-14 12:46:19      4  g4si3TQ8
16 2019-03-12 15:33:28      3  Y3wTtqaJ
6  2019-02-16 14:52:23      3  bQXWpQ2z
11 2019-02-26 12:45:10      3  FEgRztcr
8  2019-02-20 16:35:12      3  zVuiSTm1
3  2019-02-10 16:50:22      2  M56OK96C
10 2019-02-24 12:39:30      2  MKDhBt9L
7  2019-02-18 15:45:33      2  gsFVGOTy
26 2019-04-03 15:12:15      2  NJ1D9dAt
9  2019-02-22 15:52:27      1  kuULtbnm
5  2019-02-14 15:10:45      1  LioXfSPk
4  2019-02-12 14:16:28      1  q2fqVqPc
1  2019-02-06 15:30:54      1  Q62R1Ue7
2  2019-02-08 14:53:45      1  GmfSxgPs
0  2019-02-04 13:22:34      1  6ukoNykP

In [68]:
position['month'] = pd.DatetimeIndex(position['timestamp']).month

In [69]:
position.head()

            timestamp  level   page_id  month
0 2019-02-04 13:22:34      1  6ukoNykP      2
1 2019-02-06 15:30:54      1  Q62R1Ue7      2
2 2019-02-08 14:53:45      1  GmfSxgPs      2
3 2019-02-10 16:50:22      2  M56OK96C      2
4 2019-02-12 14:16:28      1  q2fqVqPc      2

In [70]:
position.groupby('month')['level'].mean()

month
2    1.750000
3    5.769231
4    6.214286
Name: level, dtype: float64

## Обработка ошибок: try-except
<a id='try_except'></a>

In [71]:
position = [
    ['2019-05-01', '6'],
    ['2019-05-02', '5'],
    ['2019-05-03', '5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', '4'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]

In [72]:
count_lines = 0
total_position = 0

In [73]:
for row in position:
    count_lines += 1
    level = int(row[1]) #в этой переменной сохраните позицию в выдаче 
    total_position += level#сложите все позиции в этой переменной

In [74]:
print(total_position/count_lines)

4.4

Формат выгрузки часто согласуют заранее: это помогает избежать проблем с некорректными данными. Вот и вам разработчики прислали формат на согласование: позиция сайта в выдаче на конкретную дату.
Напишите цикл, подсчитывающий количество строк в данных. Результат выведите на экран.

In [75]:
position = [
    ['2019-05-01', '- 6'],
    ['2019-05-02', '+5'],
    ['2019-05-03', ' 5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', 'Error 5'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]
count_lines = 0
total_position = 0

for row in position:
    count_lines += 1
    level = int(row[1]) #в этой переменной сохраните позицию в выдаче 
    total_position += level #сложите все позиции в этой переменной

ValueError: invalid literal for int() with base 10: '- 6'

In [76]:
print(total_position/count_lines)

0.0

In [77]:
int(+1)

1

In [78]:
position = [
    ['2019-05-01', '- 6'],
    ['2019-05-02', '+5'],
    ['2019-05-03', ' 5'],
    ['2019-05-04', '4'],
    ['2019-05-05', '5'],
    ['2019-05-06', '5'],
    ['2019-05-07', '4'],
    ['2019-05-08', 'Error 5'],
    ['2019-05-09', '3'],
    ['2019-05-10', '3'],
]


count_lines = 0
wrong_lines_content = []

for row in position:
    count_lines+=1
    try:
        level = int(row[1])
        
    except:
        wrong_lines_content.append(row)
print('Количество измерений', count_lines)
print('Некорректные строки', wrong_lines_content)

Количество измерений 10
Некорректные строки [['2019-05-01', '- 6'], ['2019-05-08', 'Error 5']]

In [79]:
data_final

,subcategory_id,source,visits,Unnamed: 3,subcategory_name,category_id,category_name
0,cf2e61c7af,direct,501165.668858,NaN,Мобильные телефоны,09f279a643,Электроника
1,0cd903d1cc,direct,126342.359505,NaN,Ноутбуки,3509869a61,Компьютерная техника
2,ef35bc88a7,direct,95626.321402,NaN,Телевизоры,09f279a643,Электроника
3,6ff9f4014c,direct,75680.653002,NaN,Планшеты,3509869a61,Компьютерная техника
4,72bc238e4d,direct,64435.934651,NaN,Наушники и Bluetooth-гарнитуры,09f279a643,Электроника
...,...,...,...,...,...,...,...
1925,c51343bf77,organic,15.640773,NaN,Свитеры и кардиганы,6074ad29ac,"Одежда, обувь и аксессуары"
1926,d942687638,organic,13.87554,NaN,Термобелье,6074ad29ac,"Одежда, обувь и аксессуары"
1927,976642886f,organic,9.204211,NaN,"Наклейки, шильдики и значки",65922fa39c,Авто
1928,075994491e,organic,4.606261,NaN,Гигиена полости рта,7dbac4c1a3,Детские товары
1929,total,organic,"""5687882""",NaN,NaN,NaN,NaN

## Сводные таблицы
<a id='pivot_table'></a>

 Pandas для подготовки сводных таблиц вызывают метод pivot_table().
Аргументы метода:
## index — столбец или столбцы, по которым группируют данные (название товара)
## columns — столбец, по значениям которого происходит группировка (даты)
## values — значения, по которым мы хотим увидеть сводную таблицу (количество проданного товара)
## aggfunc — функция, применяемая к значениям (сумма товаров)

In [80]:
data_pivot = data_final.pivot_table(index=['category_name','subcategory_name'],columns='source',values='visits',aggfunc='sum')

In [81]:
data_pivot

source                                        direct       organic
category_name subcategory_name
Авто          Автоакустика               5915.606541  15433.405558
              Автомагнитолы              7783.806626  18690.016622
              Автомобильные инверторы     145.925199    150.592871
              Автомобильные компрессоры   407.264303    790.164679
              Автомобильные телевизоры    975.978827   2246.595618
...                                              ...           ...
Электроника   Чехлы                      4582.490928  11758.626255
              Чехлы-аккумуляторы          219.497835    331.593190
              Штативы и моноподы         1152.649574   2540.285866
              Экшн-камеры                4757.007263  12376.961199
              Электронные книги          4515.013986  11364.344055

[934 rows x 2 columns]

In [82]:
data_pivot_with_reset_index = data_pivot.reset_index()
print(data_pivot_with_reset_index.head(10))

source category_name            subcategory_name       direct       organic
0               Авто                Автоакустика  5915.606541  15433.405558
1               Авто               Автомагнитолы  7783.806626  18690.016622
2               Авто     Автомобильные инверторы   145.925199    150.592871
3               Авто   Автомобильные компрессоры   407.264303    790.164679
4               Авто    Автомобильные телевизоры   975.978827   2246.595618
5               Авто  Автомобильные холодильники   204.631014    285.110834
6               Авто            Автосигнализации   494.025691   1026.092391
7               Авто      Аккумуляторные батареи  1175.227510   2657.217881
8               Авто                   Антифризы   736.588757   1568.277621
9               Авто         Багажники, рейлинги   342.372257    664.308906

In [83]:
data_pivot['ratio'] = data_pivot['organic']/data_pivot['direct']

In [84]:
data_pivot

source                                        direct       organic     ratio
category_name subcategory_name
Авто          Автоакустика               5915.606541  15433.405558  2.608930
              Автомагнитолы              7783.806626  18690.016622  2.401141
              Автомобильные инверторы     145.925199    150.592871  1.031987
              Автомобильные компрессоры   407.264303    790.164679  1.940177
              Автомобильные телевизоры    975.978827   2246.595618  2.301890
...                                              ...           ...       ...
Электроника   Чехлы                      4582.490928  11758.626255  2.565990
              Чехлы-аккумуляторы          219.497835    331.593190  1.510690
              Штативы и моноподы         1152.649574   2540.285866  2.203867
              Экшн-камеры                4757.007263  12376.961199  2.601838
              Электронные книги          4515.013986  11364.344055  2.517012

[934 rows x 3 columns]

In [85]:
print(data_pivot.loc[data_pivot['direct']>1000].sort_values(by='ratio',ascending=False))

source                                                       direct  \
category_name              subcategory_name
Авто                       Шины                        39638.202995
Бытовая техника            Стиральные машины           22064.436847
Спорт и отдых              Велосипеды                  16009.579071
Детские товары             Коляски                     18079.643217
Строительство и ремонт     Сварочные аппараты           6175.438323
...                                                             ...
Товары для здоровья        Бандажи и ортезы             1659.195233
Электроника                Защитные пленки и стекла     1560.395673
Строительство и ремонт     Нивелиры и лазерные уровни   1651.947395
Одежда, обувь и аксессуары Туфли                        1036.253838
                           Сапоги                       1009.586105

source                                                       organic     ratio
category_name              subcategory_name
Авто                       Шины                        153859.454228  3.881595
Бытовая техника            Стиральные машины            64570.606526  2.926456
Спорт и отдых              Велосипеды                   46087.870786  2.878768
Детские товары             Коляски                      52005.251013  2.876453
Строительство и ремонт     Сварочные аппараты           17325.802396  2.805599
...                                                              ...       ...
Товары для здоровья        Бандажи и ортезы              3453.165773  2.081229
Электроника                Защитные пленки и стекла      3246.629811  2.080645
Строительство и ремонт     Нивелиры и лазерные уровни    3436.972506  2.080558
Одежда, обувь и аксессуары Туфли                         2097.368209  2.023991
                           Сапоги                        2021.903456  2.002705

[266 rows x 3 columns]

In [86]:
df = pd.DataFrame({
    'name': ['Сырок Мечта', 'Молоко Отличное', 'Сырок Мечта', 'Сырок Дружба',\
             'Сырок Дружба', 'Молоко Вкусное'],
    'count': [120, 200, 125, 100, 35, 500]
})

print(df['name'].value_counts())

Сырок Мечта        2
Сырок Дружба       2
Молоко Отличное    1
Молоко Вкусное     1
Name: name, dtype: int64

In [87]:
df

              name  count
0      Сырок Мечта    120
1  Молоко Отличное    200
2      Сырок Мечта    125
3     Сырок Дружба    100
4     Сырок Дружба     35
5   Молоко Вкусное    500

In [88]:
df.groupby('name')['count'].sum()

name
Молоко Вкусное     500
Молоко Отличное    200
Сырок Дружба       135
Сырок Мечта        245
Name: count, dtype: int64

In [89]:
df['name'].duplicated()

0    False
1    False
2     True
3    False
4     True
5    False
Name: name, dtype: bool

In [90]:
mechta = df[df['name'] == 'Сырок Мечта']['count'].sum()
druzhba = df[df['name'] == 'Сырок Дружба']['count'].sum()

df = df.drop_duplicates(subset=['name'], keep='first')
print(df)
df = df.drop_duplicates(subset=['name'], keep='last')
print(df)

              name  count
0      Сырок Мечта    120
1  Молоко Отличное    200
3     Сырок Дружба    100
5   Молоко Вкусное    500
              name  count
0      Сырок Мечта    120
1  Молоко Отличное    200
3     Сырок Дружба    100
5   Молоко Вкусное    500

In [91]:
df = df.reset_index(drop=True)
print(df)

              name  count
0      Сырок Мечта    120
1  Молоко Отличное    200
2     Сырок Дружба    100
3   Молоко Вкусное    500

In [92]:
df.loc[0, 'count'] = mechta
df.loc[2, 'count'] = druzhba

print(df)

              name  count
0      Сырок Мечта    245
1  Молоко Отличное    200
2     Сырок Дружба    135
3   Молоко Вкусное    500

## Лаборатория ручного поиска дубликатов
<a id='dupl'></a>

In [93]:
stock = pd.read_excel('stock.xlsx',sheet_name='storehouse')

In [94]:
stock.head(10)

          id                              item  count
0  100480924     Смартфон Xiaomi Redmi 6A 16GB     32
1  100480929     Смартфон Xiaomi Redmi 6A 16GB     10
2  100480938  Смартфон Samsung Galaxy A30 32GB     49
3  100480952  смартфон Samsung Galaxy A30 32gb     11
4  100480959          Смартфон HUAWEI P30 lite      5
5  100480975     Смартфон Apple iPhone Xr 64gb     10
6  100480988            Смартфон Honor 8X 64GB     64
7  100480998          Смартфон HUAWEI P30 lite     33
8  100481008     Смартфон Xiaomi Redmi 6A 16GB      2
9  100481020     Смартфон Apple iPhone Xr 64GB     19

In [95]:
stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      10 non-null     int64
 1   item    10 non-null     object
 2   count   10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [96]:
stock['item'].duplicated().sum()

3

In [97]:
stock['item'].value_counts()

Смартфон Xiaomi Redmi 6A 16GB       3
Смартфон HUAWEI P30 lite            2
Смартфон Apple iPhone Xr 64gb       1
Смартфон Samsung Galaxy A30 32GB    1
Смартфон Honor 8X 64GB              1
Смартфон Apple iPhone Xr 64GB       1
смартфон Samsung Galaxy A30 32gb    1
Name: item, dtype: int64

In [98]:
xiaomi = stock.loc[stock['item']=='Смартфон Xiaomi Redmi 6A 16GB']['count'].sum()

In [99]:
xiaomi

44

In [100]:
huawei = stock.loc[stock['item']=='Смартфон HUAWEI P30 lite']['count'].sum()

In [101]:
huawei

38

In [102]:
stock = stock.drop_duplicates(subset=['item'],keep='first')

In [103]:
stock = stock.reset_index(drop=True)

In [104]:
stock

          id                              item  count
0  100480924     Смартфон Xiaomi Redmi 6A 16GB     32
1  100480938  Смартфон Samsung Galaxy A30 32GB     49
2  100480952  смартфон Samsung Galaxy A30 32gb     11
3  100480959          Смартфон HUAWEI P30 lite      5
4  100480975     Смартфон Apple iPhone Xr 64gb     10
5  100480988            Смартфон Honor 8X 64GB     64
6  100481020     Смартфон Apple iPhone Xr 64GB     19

In [105]:
stock.loc[0,'count'] = xiaomi

In [107]:
stock.loc[3,'count'] = huawei

In [108]:
stock

          id                              item  count
0  100480924     Смартфон Xiaomi Redmi 6A 16GB     44
1  100480938  Смартфон Samsung Galaxy A30 32GB     49
2  100480952  смартфон Samsung Galaxy A30 32gb     11
3  100480959          Смартфон HUAWEI P30 lite     38
4  100480975     Смартфон Apple iPhone Xr 64gb     10
5  100480988            Смартфон Honor 8X 64GB     64
6  100481020     Смартфон Apple iPhone Xr 64GB     19